# Project Description 
You and your business partner were recently approached by another local business owner who is interested in purchasing Maven Movies. He has lots of questions for 
you about your business and the rental business in general. His offer seems very generous, so you are going to entertain his questions. Leverage your SQL skills to 
extract and analyze data from various tables in the Maven MOveies database to answer your potential Acquirer's questions.

In [1]:
import os, sys
import mysql.connector as connector
sys.path.append("..")
from display.display_query import *

# Create Connection and Cursor Object

In [2]:
print("Creating a connection between MySQL and Python")
dbconfig={"user":"root", "password":os.environ["MYSQL_ROOT_PASSWORD"], "port":33061, "host":"localhost", "database": "db_mavenmovies"}
connection=connector.connect(**dbconfig)
print("Connection established between MySQL and Python")

print("Creating cursor object from connection")
cursor = connection.cursor()
print("Cursor object created to communicate with MySQL")

Creating a connection between MySQL and Python
Connection established between MySQL and Python
Creating cursor object from connection
Cursor object created to communicate with MySQL

# Show Tables in the database

In [3]:
show_tables_query = """SHOW TABLES;"""
execute_display_query_results(query=show_tables_query, cursor_object=cursor)

+---------------------------------+
|    Tables_in_db_mavenmovies     |
+---------------------------------+
|            tbl_actor            |
|         tbl_actor_award         |
|           tbl_address           |
|           tbl_advisor           |
|          tbl_category           |
|            tbl_city             |
|           tbl_country           |
|          tbl_customer           |
|            tbl_film             |
|         tbl_film_actor          |
|        tbl_film_category        |
|          tbl_film_text          |
|          tbl_inventory          |
|          tbl_investor           |
|          tbl_language           |
|           tbl_payment           |
|           tbl_rental            |
|            tbl_staff            |
|            tbl_store            |
|         view_actor_info         |
|       view_customer_list        |
|         view_film_list          |
| view_nicer_but_slower_film_list |
|   view_sales_by_film_category   |
|       view_sales_by_store       |
|         view_staff_list         |
+---------------------------------+
26 rows returned in time: (0.006 sec)

# List columns in each table

In [4]:
query = "SHOW TABLES;"
cursor.execute(query)
tables = cursor.fetchall()
for table in tables:
    tbl = table[0]
    column_query = f"""SHOW COLUMNS FROM {tbl}"""
    print(f"{tbl}:")
    execute_display_query_results(query=column_query, cursor_object=cursor)

tbl_actor:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|  actor_id   | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
| first_name  |    varchar(45)    |  NO  |     |       NULL        |                                               |
|  last_name  |    varchar(45)    |  NO  | MUL |       NULL        |                                               |
| last_update |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
4 rows returned in time: (0.003 sec)


tbl_actor_award:
+----------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|     Field      |       Type        | Null | Key |      Default      |                     Extra                     |
+----------------+-------------------+------+-----+-------------------+-----------------------------------------------+
| actor_award_id | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|    actor_id    |     smallint      | YES  |     |       NULL        |                                               |
|   first_name   |    varchar(45)    |  NO  |     |       NULL        |                                               |
|   last_name    |    varchar(45)    |  NO  | MUL |       NULL        |                                               |
|     awards     |    varchar(45)    |  NO  |     |       NULL        |                                               |
|  last_update   |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+----------------+-------------------+------+-----+-------------------+-----------------------------------------------+
6 rows returned in time: (0.002 sec)


tbl_address:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
| address_id  | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|   address   |    varchar(50)    |  NO  |     |       NULL        |                                               |
|  address2   |    varchar(50)    | YES  |     |       NULL        |                                               |
|  district   |    varchar(20)    |  NO  |     |       NULL        |                                               |
|   city_id   | smallint unsigned |  NO  | MUL |       NULL        |                                               |
| postal_code |    varchar(10)    | YES  |     |       NULL        |                                               |
|    phone    |    varchar(20)    |  NO  |     |       NULL        |                                               |
| last_update |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
8 rows returned in time: (0.001 sec)


tbl_advisor:
+--------------+-------------------+------+-----+---------+----------------+
|    Field     |       Type        | Null | Key | Default |     Extra      |
+--------------+-------------------+------+-----+---------+----------------+
|  advisor_id  | smallint unsigned |  NO  | PRI |  NULL   | auto_increment |
|  first_name  |    varchar(45)    |  NO  |     |  NULL   |                |
|  last_name   |    varchar(45)    |  NO  |     |  NULL   |                |
| is_chairmain | smallint unsigned |  NO  |     |  NULL   |                |
+--------------+-------------------+------+-----+---------+----------------+
4 rows returned in time: (0.001 sec)


tbl_category:
+-------------+------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type       | Null | Key |      Default      |                     Extra                     |
+-------------+------------------+------+-----+-------------------+-----------------------------------------------+
| category_id | tinyint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|    name     |   varchar(25)    |  NO  |     |       NULL        |                                               |
| last_update |    timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+------------------+------+-----+-------------------+-----------------------------------------------+
3 rows returned in time: (0.001 sec)


tbl_city:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|   city_id   | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|    city     |    varchar(50)    |  NO  |     |       NULL        |                                               |
| country_id  | smallint unsigned |  NO  | MUL |       NULL        |                                               |
| last_update |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
4 rows returned in time: (0.001 sec)


tbl_country:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
| country_id  | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|   country   |    varchar(50)    |  NO  |     |       NULL        |                                               |
| last_update |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
3 rows returned in time: (0.001 sec)


tbl_customer:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
| customer_id | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|  store_id   | tinyint unsigned  |  NO  | MUL |       NULL        |                                               |
| first_name  |    varchar(45)    |  NO  |     |       NULL        |                                               |
|  last_name  |    varchar(45)    |  NO  | MUL |       NULL        |                                               |
|    email    |    varchar(50)    | YES  |     |       NULL        |                                               |
| address_id  | smallint unsigned |  NO  | MUL |       NULL        |                                               |
|   active    |    tinyint(1)     |  NO  |     |         1         |                                               |
| create_date |     datetime      |  NO  |     |       NULL        |                                               |
| last_update |     timestamp     | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
9 rows returned in time: (0.001 sec)


tbl_film:
+----------------------+---------------------------------------------------------------------+------+-----+-------------------+-----------------------------------------------+
|        Field         |                                Type                                 | Null | Key |      Default      |                     Extra                     |
+----------------------+---------------------------------------------------------------------+------+-----+-------------------+-----------------------------------------------+
|       film_id        |                          smallint unsigned                          |  NO  | PRI |       NULL        |                auto_increment                 |
|        title         |                            varchar(255)                             |  NO  | MUL |       NULL        |                                               |
|     description      |                                text                                 | YES  |     |       NULL        |                                               |
|     release_year     |                                year                                 | YES  |     |       NULL        |                                               |
|     language_id      |                          tinyint unsigned                           |  NO  | MUL |       NULL        |                                               |
| original_language_id |                          tinyint unsigned                           | YES  | MUL |       NULL        |                                               |
|   rental_duration    |                          tinyint unsigned                           |  NO  |     |         3         |                                               |
|     rental_rate      |                            decimal(4,2)                             |  NO  |     |       4.99        |                                               |
|        length        |                          smallint unsigned                          | YES  |     |       NULL        |                                               |
|   replacement_cost   |                            decimal(5,2)                             |  NO  |     |       19.99       |                                               |
|        rating        |                 enum('G','PG','PG-13','R','NC-17')                  | YES  |     |         G         |                                               |
|   special_features   | set('Trailers','Commentaries','Deleted Scenes','Behind the Scenes') | YES  |     |       NULL        |                                               |
|     last_update      |                              timestamp                              |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+----------------------+---------------------------------------------------------------------+------+-----+-------------------+-----------------------------------------------+
13 rows returned in time: (0.001 sec)


tbl_film_actor:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|  actor_id   | smallint unsigned |  NO  | PRI |       NULL        |                                               |
|   film_id   | smallint unsigned |  NO  | PRI |       NULL        |                                               |
| last_update |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
3 rows returned in time: (0.002 sec)


tbl_film_category:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|   film_id   | smallint unsigned |  NO  | PRI |       NULL        |                                               |
| category_id | tinyint unsigned  |  NO  | PRI |       NULL        |                                               |
| last_update |     timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
3 rows returned in time: (0.001 sec)


tbl_film_text:
+-------------+--------------+------+-----+---------+-------+
|    Field    |     Type     | Null | Key | Default | Extra |
+-------------+--------------+------+-----+---------+-------+
|   film_id   |   smallint   |  NO  | PRI |  NULL   |       |
|    title    | varchar(255) |  NO  | MUL |  NULL   |       |
| description |     text     | YES  |     |  NULL   |       |
+-------------+--------------+------+-----+---------+-------+
3 rows returned in time: (0.001 sec)


tbl_inventory:
+--------------+--------------------+------+-----+-------------------+-----------------------------------------------+
|    Field     |        Type        | Null | Key |      Default      |                     Extra                     |
+--------------+--------------------+------+-----+-------------------+-----------------------------------------------+
| inventory_id | mediumint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|   film_id    | smallint unsigned  |  NO  | MUL |       NULL        |                                               |
|   store_id   |  tinyint unsigned  |  NO  | MUL |       NULL        |                                               |
| last_update  |     timestamp      |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+--------------+--------------------+------+-----+-------------------+-----------------------------------------------+
4 rows returned in time: (0.001 sec)


tbl_investor:
+--------------+-------------------+------+-----+---------+----------------+
|    Field     |       Type        | Null | Key | Default |     Extra      |
+--------------+-------------------+------+-----+---------+----------------+
| investor_id  | smallint unsigned |  NO  | PRI |  NULL   | auto_increment |
|  first_name  |    varchar(45)    |  NO  |     |  NULL   |                |
|  last_name   |    varchar(45)    |  NO  |     |  NULL   |                |
| company_name |    varchar(45)    |  NO  |     |  NULL   |                |
+--------------+-------------------+------+-----+---------+----------------+
4 rows returned in time: (0.001 sec)


tbl_language:
+-------------+------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type       | Null | Key |      Default      |                     Extra                     |
+-------------+------------------+------+-----+-------------------+-----------------------------------------------+
| language_id | tinyint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
|    name     |     char(20)     |  NO  |     |       NULL        |                                               |
| last_update |    timestamp     |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+-------------+------------------+------+-----+-------------------+-----------------------------------------------+
3 rows returned in time: (0.001 sec)


tbl_payment:
+--------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field     |       Type        | Null | Key |      Default      |                     Extra                     |
+--------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|  payment_id  | smallint unsigned |  NO  | PRI |       NULL        |                auto_increment                 |
| customer_id  | smallint unsigned |  NO  | MUL |       NULL        |                                               |
|   staff_id   | tinyint unsigned  |  NO  | MUL |       NULL        |                                               |
|  rental_id   |        int        | YES  | MUL |       NULL        |                                               |
|    amount    |   decimal(5,2)    |  NO  |     |       NULL        |                                               |
| payment_date |     datetime      |  NO  |     |       NULL        |                                               |
| last_update  |     timestamp     | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+--------------+-------------------+------+-----+-------------------+-----------------------------------------------+
7 rows returned in time: (0.001 sec)


tbl_rental:
+--------------+--------------------+------+-----+-------------------+-----------------------------------------------+
|    Field     |        Type        | Null | Key |      Default      |                     Extra                     |
+--------------+--------------------+------+-----+-------------------+-----------------------------------------------+
|  rental_id   |        int         |  NO  | PRI |       NULL        |                auto_increment                 |
| rental_date  |      datetime      |  NO  | MUL |       NULL        |                                               |
| inventory_id | mediumint unsigned |  NO  | MUL |       NULL        |                                               |
| customer_id  | smallint unsigned  |  NO  | MUL |       NULL        |                                               |
| return_date  |      datetime      | YES  |     |       NULL        |                                               |
|   staff_id   |  tinyint unsigned  |  NO  | MUL |       NULL        |                                               |
| last_update  |     timestamp      |  NO  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+--------------+--------------------+------+-----+-------------------+-----------------------------------------------+
7 rows returned in time: (0.001 sec)


tbl_staff:
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|    Field    |       Type        | Null | Key |      Default      |                     Extra                     |
+-------------+-------------------+------+-----+-------------------+-----------------------------------------------+
|  staff_id   | tinyint unsigned  |  NO  | PRI |       NULL        |                auto_increment                 |
| first_name  |    varchar(45)    |  NO  |     |       NULL        |                                               |
|  last_name  |    varchar(45)    |  NO  |     |       NULL        |                                               |

# Question One
I will need a list of all staff members, including their first and last names, email addresses, and the store id where they work

In [5]:
select_query = """SELECT first_name, last_name, email, store_id FROM tbl_staff;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+------------+-----------+------------------------------+----------+
| first_name | last_name |            email             | store_id |
+------------+-----------+------------------------------+----------+
|    Mike    |  Hillyer  | Mike.Hillyer@sakilastaff.com |    1     |
|    Jon     | Stephens  | Jon.Stephens@sakilastaff.com |    2     |
+------------+-----------+------------------------------+----------+
2 rows returned in time: (0.001 sec)

# Question Two
I will need separate counts of inventory items held at each of your two stores

In [6]:
select_query = """SELECT DISTINCT(store_id),
COUNT(inventory_id) OVER(PARTITION BY store_id) AS CountInventory
FROM tbl_inventory;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+----------+----------------+
| store_id | CountInventory |
+----------+----------------+
|    1     |      2270      |
|    2     |      2311      |
+----------+----------------+
2 rows returned in time: (0.005 sec)

# Question Three 
Please provide a count of active customers for each store.
Also provide a count of all customers email addresses stored in the database

In [7]:
select_query = """SELECT DISTINCT store_id, countactive FROM 
(SELECT store_id,
COUNT(active) OVER(PARTITION BY store_id ORDER BY store_id) AS CountActive
FROM tbl_customer WHERE active = 1) as t;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT count(DISTINCT email) AS CountEmail FROM tbl_customer;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+----------+-------------+
| store_id | countactive |
+----------+-------------+
|    1     |     318     |
|    2     |     266     |
+----------+-------------+
2 rows returned in time: (0.002 sec)


+------------+
| CountEmail |
+------------+
|    599     |
+------------+
1 row returned in time: (0.001 sec)

# Question Four 
Please provide a count of unique film titles in the inventory at each store and then provide a count of the unique categories of the films

In [8]:
select_query = """SELECT store_id,
COUNT(DISTINCT film_id) AS CountFilmTitle 
FROM tbl_inventory
GROUP BY store_id;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT COUNT(DISTINCT name) AS CountCategory FROM tbl_category;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+----------+----------------+
| store_id | CountFilmTitle |
+----------+----------------+
|    1     |      759       |
|    2     |      762       |
+----------+----------------+
2 rows returned in time: (0.004 sec)


+---------------+
| CountCategory |
+---------------+
|      16       |
+---------------+
1 row returned in time: (0.001 sec)

# Question Five 
Please provide the replacement cost for the film that is least expensive to replace, the most expensive to replace, and the average of all films in the inventory

In [9]:
select_query = """SELECT 
MIN(replacement_cost) AS MinReplacementCost, 
MAX(replacement_cost) AS MaxReplacementCost,
ROUND(AVG(replacement_cost), 2) AS AvgReplacementCost 
FROM tbl_film;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+--------------------+--------------------+--------------------+
| MinReplacementCost | MaxReplacementCost | AvgReplacementCost |
+--------------------+--------------------+--------------------+
|        9.99        |       29.99        |       19.98        |
+--------------------+--------------------+--------------------+
1 row returned in time: (0.003 sec)

# Question Six 
Provide the average payment you process as well as the maximum payment processed

In [10]:
select_query = """SELECT 
ROUND(AVG(amount), 2) AS AvgAmountProcessed,
MAX(amount) AS MaxAmountProcessed
FROM tbl_payment;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+--------------------+--------------------+
| AvgAmountProcessed | MaxAmountProcessed |
+--------------------+--------------------+
|        4.20        |       11.99        |
+--------------------+--------------------+
1 row returned in time: (0.009 sec)

# Question Seven 
Provide a list of all customer identification values, first_name, last_name with a count of rentals they have made all-time, with the highest volume customers at the top of the list. Limit the result to the first 30 customers

In [11]:
select_query = """SELECT DISTINCT(c.customer_id), t.count, c.first_name, c.last_name FROM 
(SELECT customer_id, COUNT(customer_id) OVER(PARTITION BY customer_id) AS Count FROM tbl_rental) as t
INNER JOIN tbl_customer c ON c.customer_id = t.customer_id
ORDER BY count DESC LIMIT 30;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+-------------+-------+------------+-------------+
| customer_id | count | first_name |  last_name  |
+-------------+-------+------------+-------------+
|     148     |  46   |  ELEANOR   |    HUNT     |
|     526     |  45   |    KARL    |    SEAL     |
|     144     |  42   |   CLARA    |    SHAW     |
|     236     |  42   |   MARCIA   |    DEAN     |
|     75      |  41   |   TAMMY    |   SANDERS   |
|     469     |  40   |   WESLEY   |    BULL     |
|     197     |  40   |    SUE     |   PETERS    |
|     178     |  39   |   MARION   |   SNYDER    |
|     468     |  39   |    TIM     |    CARY     |
|     137     |  39   |   RHONDA   |   KENNEDY   |
|     410     |  38   |   CURTIS   |    IRBY     |
|      5      |  38   | ELIZABETH  |    BROWN    |
|     459     |  38   |   TOMMY    |   COLLAZO   |
|     295     |  38   |   DAISY    |    BATES    |
|     366     |  37   |  BRANDON   |    HUEY     |
|     198     |  37   |   ELSIE    |   KELLEY    |
|     257     |  37   |   MARSHA   |   DOUGLAS   |
|     176     |  37   |    JUNE    |   CARROLL   |
|     439     |  36   | ALEXANDER  |   FENNELL   |
|     29      |  36   |   ANGELA   |  HERNANDEZ  |
|     348     |  36   |   ROGER    | QUINTANILLA |
|     380     |  36   |  RUSSELL   |   BRINSON   |
|     354     |  36   |   JUSTIN   |     NGO     |
|     267     |  36   |   MARGIE   |    WADE     |
|     371     |  35   |   BILLY    |   POULIN    |
|     373     |  35   |   LOUIS    |    LEONE    |
|     273     |  35   | PRISCILLA  |    LOWE     |
|     50      |  35   |   DIANE    |   COLLINS   |
|     274     |  35   |   NAOMI    |  JENNINGS   |
|     381     |  35   |   BOBBY    |  BOUDREAU   |
+-------------+-------+------------+-------------+
30 rows returned in time: (0.017 sec)

# Question Eight 
Provide a list of the managers' names at each store with the full address of each property(street address, district, city and country)

In [12]:
select_query = """SELECT * FROM tbl_store;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT staff_id, first_name, last_name, address_id, store_id FROM tbl_staff;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT * FROM tbl_address LIMIT 5;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT * FROM tbl_city LIMIT 5;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT * FROM tbl_country LIMIT 5;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

select_query = """SELECT first_name, last_name, address, district, city, country
FROM tbl_staff AS sf
INNER JOIN tbl_store AS st ON st.store_id = sf.store_id
INNER JOIN tbl_address AS ad ON ad.address_id = sf.address_id
INNER JOIN tbl_city AS c ON c.city_id = ad.city_id
INNER JOIN tbl_country AS co ON c.country_id = co.country_id;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+----------+------------------+------------+---------------------+
| store_id | manager_staff_id | address_id |     last_update     |
+----------+------------------+------------+---------------------+
|    1     |        1         |     1      | 2006-02-15 04:57:12 |
|    2     |        2         |     2      | 2006-02-15 04:57:12 |
+----------+------------------+------------+---------------------+
2 rows returned in time: (0.001 sec)


+----------+------------+-----------+------------+----------+
| staff_id | first_name | last_name | address_id | store_id |
+----------+------------+-----------+------------+----------+
|    1     |    Mike    |  Hillyer  |     3      |    1     |
|    2     |    Jon     | Stephens  |     4      |    2     |
+----------+------------+-----------+------------+----------+
2 rows returned in time: (0.0 sec)


+------------+----------------------+----------+----------+---------+-------------+-------------+---------------------+
| address_id |       address        | address2 | district | city_id | postal_code |    phone    |     last_update     |
+------------+----------------------+----------+----------+---------+-------------+-------------+---------------------+
|     1      |  47 MySakila Drive   |   NULL   | Alberta  |   300   |             |             | 2014-09-25 22:30:27 |
|     2      |  28 MySQL Boulevard  |   NULL   |   QLD    |   576   |             |             | 2014-09-25 22:30:09 |
|     3      |  23 Workhaven Lane   |   NULL   | Alberta  |   300   |             | 14033335568 | 2014-09-25 22:30:27 |
|     4      | 1411 Lillydale Drive |   NULL   |   QLD    |   576   |             | 6172235589  | 2014-09-25 22:30:09 |
|     5      |    1913 Hanoi Way    |          | Nagasaki |   463   |    35200    | 28303384290 | 2014-09-25 22:31:53 |
+------------+----------------------+----------+----------+---------+-------------+-------------+---------------------+
5 rows returned in time: (0.0 sec)


+---------+--------------------+------------+---------------------+
| city_id |        city        | country_id |     last_update     |
+---------+--------------------+------------+---------------------+
|    1    | A Corua (La Corua) |     87     | 2006-02-15 04:45:25 |
|    2    |        Abha        |     82     | 2006-02-15 04:45:25 |
|    3    |     Abu Dhabi      |    101     | 2006-02-15 04:45:25 |
|    4    |        Acua        |     60     | 2006-02-15 04:45:25 |
|    5    |       Adana        |     97     | 2006-02-15 04:45:25 |
+---------+--------------------+------------+---------------------+
5 rows returned in time: (0.0 sec)


+------------+----------------+---------------------+
| country_id |    country     |     last_update     |
+------------+----------------+---------------------+
|     1      |  Afghanistan   | 2006-02-15 04:44:00 |
|     2      |    Algeria     | 2006-02-15 04:44:00 |
|     3      | American Samoa | 2006-02-15 04:44:00 |
|     4      |     Angola     | 2006-02-15 04:44:00 |
|     5      |    Anguilla    | 2006-02-15 04:44:00 |
+------------+----------------+---------------------+
5 rows returned in time: (0.0 sec)


+------------+-----------+----------------------+----------+------------+-----------+
| first_name | last_name |       address        | district |    city    |  country  |
+------------+-----------+----------------------+----------+------------+-----------+
|    Mike    |  Hillyer  |  23 Workhaven Lane   | Alberta  | Lethbridge |  Canada   |
|    Jon     | Stephens  | 1411 Lillydale Drive |   QLD    | Woodridge  | Australia |
+------------+-----------+----------------------+----------+------------+-----------+
2 rows returned in time: (0.0 sec)

# Question Nine 

<div>
    <p>
    I would like to get a better understanding of all of the inventory that would come along with the business. Please pull together a list of each inventory item you have stocked, 
    including the store_id number, the inventory_id, the name of the film, the film's rating
    and it's rental rate and replacement cost
    </p>
</div>

In [21]:
#Results limited to 30 to avoid very large output
select_query = """SELECT store_id, inventory_id, title, rating, rental_rate, replacement_cost
FROM tbl_film AS f
INNER JOIN tbl_inventory AS i ON i.film_id = f.film_id LIMIT 30;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+----------+--------------+------------------+--------+-------------+------------------+
| store_id | inventory_id |      title       | rating | rental_rate | replacement_cost |
+----------+--------------+------------------+--------+-------------+------------------+
|    1     |      1       | ACADEMY DINOSAUR |   PG   |    0.99     |      20.99       |
|    1     |      2       | ACADEMY DINOSAUR |   PG   |    0.99     |      20.99       |
|    1     |      3       | ACADEMY DINOSAUR |   PG   |    0.99     |      20.99       |
|    1     |      4       | ACADEMY DINOSAUR |   PG   |    0.99     |      20.99       |
|    1     |      16      | AFFAIR PREJUDICE |   G    |    2.99     |      26.99       |
|    1     |      17      | AFFAIR PREJUDICE |   G    |    2.99     |      26.99       |
|    1     |      18      | AFFAIR PREJUDICE |   G    |    2.99     |      26.99       |
|    1     |      19      | AFFAIR PREJUDICE |   G    |    2.99     |      26.99       |
|    1     |      26      |   AGENT TRUMAN   |   PG   |    2.99     |      17.99       |
|    1     |      27      |   AGENT TRUMAN   |   PG   |    2.99     |      17.99       |
|    1     |      28      |   AGENT TRUMAN   |   PG   |    2.99     |      17.99       |
|    1     |      32      | AIRPLANE SIERRA  | PG-13  |    4.99     |      28.99       |
|    1     |      33      | AIRPLANE SIERRA  | PG-13  |    4.99     |      28.99       |
|    1     |      41      |  ALABAMA DEVIL   | PG-13  |    2.99     |      21.99       |
|    1     |      42      |  ALABAMA DEVIL   | PG-13  |    2.99     |      21.99       |
|    1     |      43      |  ALABAMA DEVIL   | PG-13  |    2.99     |      21.99       |
|    1     |      46      | ALADDIN CALENDAR | NC-17  |    4.99     |      24.99       |
|    1     |      47      | ALADDIN CALENDAR | NC-17  |    4.99     |      24.99       |
|    1     |      48      | ALADDIN CALENDAR | NC-17  |    4.99     |      24.99       |
|    1     |      49      | ALADDIN CALENDAR | NC-17  |    4.99     |      24.99       |
|    1     |      53      | ALAMO VIDEOTAPE  |   G    |    0.99     |      16.99       |
|    1     |      54      | ALAMO VIDEOTAPE  |   G    |    0.99     |      16.99       |
|    1     |      55      | ALAMO VIDEOTAPE  |   G    |    0.99     |      16.99       |
|    1     |      56      | ALAMO VIDEOTAPE  |   G    |    0.99     |      16.99       |
|    1     |      60      |  ALASKA PHANTOM  |   PG   |    0.99     |      22.99       |
|    1     |      61      |  ALASKA PHANTOM  |   PG   |    0.99     |      22.99       |
|    1     |      62      |  ALASKA PHANTOM  |   PG   |    0.99     |      22.99       |
|    1     |      71      |   ALIEN CENTER   | NC-17  |    2.99     |      10.99       |
|    1     |      72      |   ALIEN CENTER   | NC-17  |    2.99     |      10.99       |
|    1     |      77      | ALLEY EVOLUTION  | NC-17  |    2.99     |      23.99       |
+----------+--------------+------------------+--------+-------------+------------------+
30 rows returned in time: (0.001 sec)

# Question Ten
From the same list of films you just pulled, please roll that data up and provide a summary level overview of your inventory. I would like to know how many inventory items you have with each rating at each store

In [20]:
select_query = """SELECT DISTINCT(rating), 
COUNT(inventory_id) OVER(PARTITION BY rating) AS CountInventory FROM 
(SELECT store_id, inventory_id, title, rating, rental_rate, replacement_cost
FROM tbl_film AS f
INNER JOIN tbl_inventory AS i ON i.film_id = f.film_id) AS t
ORDER BY CountInventory DESC;"""
execute_display_query_results(query=select_query, cursor_object=cursor)

+--------+----------------+
| rating | CountInventory |
+--------+----------------+
| PG-13  |      1018      |
| NC-17  |      944       |
|   PG   |      924       |
|   R    |      904       |
|   G    |      791       |
+--------+----------------+
5 rows returned in time: (0.006 sec)